<template>
  <body id="app">
    <TheHeader></TheHeader>
    <main>
      <div class="container">
        <section class="info-section">
          <div class="info__service">
            <h1 class="h1">Сервис по обслуживанию корпоративных клиентов</h1>
            <p class="info__text">
              Группа компаний "МЕДИКА" – один из крупнейших медицинских
              холдингов Санкт-Петербурга предлагает Вам и сотрудникам вашей
              компании медицинское обслуживание экспертного уровня.
            </p>
          </div>
          <div class="info__img"></div>
        </section>
        <section class="firm-section">
          <p class="step">Шаг 1</p>
          <h3>Укажите организацию</h3>
          <SearchFirm
            :firms="arrayFirms"
            :index="indexFirm"
            @changeSelect="changeSelect"
            @searchSelect="searchSelect"
            @clearSelect="clearSelect"
          ></SearchFirm>
          <AllFirms
            :firms="arrayFirms"
            @SelectedOption="selectedOption"
            :openOptions="openOptions"
          ></AllFirms>
          <AboutFirm
            :firms="arrayFirms"
            :index="indexFirm"
            v-if="this.indexFirm.length > 0"
            @ActivateStep2="activateStep2"
          ></AboutFirm>
        </section>
        <ContactPerson
          @saveForm="saveForm"
          v-if="this.steps.step2"
        ></ContactPerson>
        <ClientsForm
          @saveClientForm="saveClientForm"
          v-if="this.steps.step3"
        ></ClientsForm>
        <DirectionDoctor
          :doctorsDirection="doctorsDirection"
          @selectOption="doctorOption"
          v-if="this.steps.step4"
        ></DirectionDoctor>
        <ChooseDoctor
          :doctorsDirection="doctorsDirection"
          :doctorsObject="doctorsObject"
          :directionName="directionName"
          @chooseDoctor="chooseDoctor"
          v-if="this.steps.step4"
        ></ChooseDoctor>
        <DateOfAppointment
          :doctorsObject="doctorsObject"
          :nameDoctor="nameDoctor"
          @chooseDoctorTime="chooseDoctorTime"
          v-if="this.steps.step5"
        ></DateOfAppointment>
        <SendData @saveAll="saveAll" v-if="this.steps.step6"></SendData>
      </div>
    </main>
    <TheFooter></TheFooter>
  </body>
</template>

<script>
import TheHeader from "./components/TheHeader";
import SearchFirm from "./components/SearchFirm";
import AllFirms from "./components/AllFirms";
import AboutFirm from "./components/AboutFirm";
import ContactPerson from "./components/ContactPerson";
import DirectionDoctor from "./components/DirectionDoctor";
import ChooseDoctor from "./components/ChooseDoctor";
import DateOfAppointment from "./components/DateOfAppointment";
import ClientsForm from "./components/ClientsForm";
import SendData from "./components/SendData";
import TheFooter from "./components/TheFooter";
export default {
  name: "App",
  data() {
    return {
      arrayFirms: [],
      indexFirm: "",
      openOptions: false,
      inputFirm: "",
      allObject: {},
      directionName: "",
      nameDoctor: "",
      doctorsObject: {
        "Имаева Светлана Игоревна": {
          info: ["Гастроэнтеролог", "19 лет", "1.jpg"],
          date: {
            "2022-04-01": ["11:00", "12:00", "14:00"],
            "2022-04-02": ["12:00", "13:00", "14:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["14:00", "15:00", "16:00"],
            "2022-04-05": ["11:00", "12:00", "14:00"],
            "2022-04-06": ["12:00", "13:00", "14:00"],
            "2022-04-07": ["10:00", "12:00", "14:00"],
            "2022-04-08": ["14:00", "15:00", "16:00"],
            "2022-04-09": ["11:00", "12:00", "14:00"],
            "2022-04-10": ["12:00", "13:00", "14:00"],
            "2022-04-11": ["10:00", "12:00", "14:00"],
            "2022-04-12": ["14:00", "15:00", "16:00"],
            "2022-04-13": ["11:00", "12:00", "14:00"],
            "2022-04-14": ["12:00", "13:00", "14:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["14:00", "15:00", "16:00"],
          },
        },
        "Петрова Аэлита Венеровна": {
          info: ["Гастроэнтеролог", "26 лет", "10.jpg"],
          date: {
            "2022-04-01": ["10:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["14:00", "15:00", "16:00"],
            "2022-04-04": ["09:00", "10:00", "11:00"],
            "2022-04-05": ["10:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["14:00", "15:00", "16:00"],
            "2022-04-08": ["09:00", "10:00", "11:00"],
            "2022-04-09": ["10:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["14:00", "15:00", "16:00"],
            "2022-04-12": ["09:00", "10:00", "11:00"],
            "2022-04-13": ["10:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["14:00", "15:00", "16:00"],
            "2022-04-16": ["09:00", "10:00", "11:00"],
          },
        },
        "Абдуллина Алия Маратовна": {
          info: ["Гинеколог", "24 года", "5.png"],
          date: {
            "2022-04-01": ["09:00", "10:00", "11:00"],
            "2022-04-02": ["14:00", "15:00", "16:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["09:00", "10:00", "11:00"],
            "2022-04-06": ["14:00", "15:00", "16:00"],
            "2022-04-07": ["10:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["09:00", "10:00", "11:00"],
            "2022-04-10": ["14:00", "15:00", "16:00"],
            "2022-04-11": ["10:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["09:00", "10:00", "11:00"],
            "2022-04-14": ["14:00", "15:00", "16:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Альмухаметов Аэлита Рамилевна": {
          info: ["Гинеколог", "10 лет", "11.jpg"],
          date: {
            "2022-04-01": ["11:00", "12:00", "14:00"],
            "2022-04-02": ["12:00", "13:00", "14:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["14:00", "15:00", "16:00"],
            "2022-04-05": ["10:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["14:00", "15:00", "16:00"],
            "2022-04-08": ["09:00", "10:00", "11:00"],
            "2022-04-09": ["10:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["14:00", "15:00", "16:00"],
            "2022-04-12": ["09:00", "10:00", "11:00"],
            "2022-04-13": ["10:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["14:00", "15:00", "16:00"],
            "2022-04-16": ["09:00", "10:00", "11:00"],
          },
        },
        "Медведев Петр Николаевич": {
          info: ["Дерматовенеролог", "15 лет", "4.png"],
          date: {
            "2022-04-01": ["09:00", "10:00", "11:00"],
            "2022-04-02": ["14:00", "15:00", "16:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["11:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["11:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["11:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["11:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["11:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["11:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Валеева Эльза Сергеевна": {
          info: ["Дерматовенеролог", "13 лет", "7.png"],
          date: {
            "2022-04-01": ["10:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["14:00", "15:00", "16:00"],
            "2022-04-04": ["09:00", "10:00", "11:00"],
            "2022-04-05": ["09:00", "10:00", "11:00"],
            "2022-04-06": ["14:00", "15:00", "16:00"],
            "2022-04-07": ["10:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["09:00", "10:00", "11:00"],
            "2022-04-10": ["14:00", "15:00", "16:00"],
            "2022-04-11": ["09:00", "10:00", "11:00"],
            "2022-04-12": ["14:00", "15:00", "16:00"],
            "2022-04-13": ["10:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["09:00", "10:00", "11:00"],
            "2022-04-16": ["14:00", "15:00", "16:00"],
          },
        },
        "Шарифуллин Эдуард Васильевич": {
          info: ["Диетолог", "21 год", "6.png"],
          date: {
            "2022-04-01": ["10:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["14:00", "15:00", "16:00"],
            "2022-04-04": ["09:00", "10:00", "11:00"],
            "2022-04-05": ["10:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["14:00", "15:00", "16:00"],
            "2022-04-08": ["09:00", "10:00", "11:00"],
            "2022-04-09": ["10:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["10:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["14:00", "15:00", "16:00"],
            "2022-04-14": ["09:00", "10:00", "11:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Чижкова Екатерина Викторовна": {
          info: ["Диетолог", "8 лет", "2.jpg"],
          date: {
            "2022-04-01": ["11:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["11:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["10:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["14:00", "15:00", "16:00"],
            "2022-04-08": ["09:00", "10:00", "11:00"],
            "2022-04-09": ["10:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["10:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["14:00", "15:00", "16:00"],
            "2022-04-14": ["09:00", "10:00", "11:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Хайретдинов Ямиль Мусаевич": {
          info: ["Кардиолог", "15 лет", "3.jpg"],
          date: {
            "2022-04-01": ["09:00", "10:00", "11:00"],
            "2022-04-02": ["14:00", "15:00", "16:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["09:00", "10:00", "11:00"],
            "2022-04-06": ["14:00", "15:00", "16:00"],
            "2022-04-07": ["10:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["09:00", "10:00", "11:00"],
            "2022-04-10": ["14:00", "15:00", "16:00"],
            "2022-04-11": ["09:00", "10:00", "11:00"],
            "2022-04-12": ["14:00", "15:00", "16:00"],
            "2022-04-13": ["10:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["09:00", "10:00", "11:00"],
            "2022-04-16": ["14:00", "15:00", "16:00"],
          },
        },
        "Сидоров Артем Петрович": {
          info: ["Кардиолог", "13 лет", "8.jpg"],
          date: {
            "2022-04-01": ["11:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["11:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["11:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["11:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["11:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["11:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["10:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Азаматова Гузель Карамовна": {
          info: ["Стоматолог", "22 года", "12.jpg"],
          date: {
            "2022-04-01": ["09:00", "10:00", "11:00"],
            "2022-04-02": ["14:00", "15:00", "16:00"],
            "2022-04-03": ["10:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["09:00", "10:00", "11:00"],
            "2022-04-06": ["14:00", "15:00", "16:00"],
            "2022-04-07": ["10:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["09:00", "10:00", "11:00"],
            "2022-04-10": ["14:00", "15:00", "16:00"],
            "2022-04-11": ["10:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["09:00", "10:00", "11:00"],
            "2022-04-14": ["14:00", "15:00", "16:00"],
            "2022-04-15": ["10:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
        "Булатов Ильнур Айнурович": {
          info: ["Стоматолог", "16 лет", "9.jpg"],
          date: {
            "2022-04-01": ["11:00", "12:00", "14:00"],
            "2022-04-02": ["11:00", "12:00", "14:00"],
            "2022-04-03": ["11:00", "12:00", "14:00"],
            "2022-04-04": ["11:00", "12:00", "14:00"],
            "2022-04-05": ["11:00", "12:00", "14:00"],
            "2022-04-06": ["11:00", "12:00", "14:00"],
            "2022-04-07": ["11:00", "12:00", "14:00"],
            "2022-04-08": ["11:00", "12:00", "14:00"],
            "2022-04-09": ["11:00", "12:00", "14:00"],
            "2022-04-10": ["11:00", "12:00", "14:00"],
            "2022-04-11": ["11:00", "12:00", "14:00"],
            "2022-04-12": ["11:00", "12:00", "14:00"],
            "2022-04-13": ["11:00", "12:00", "14:00"],
            "2022-04-14": ["11:00", "12:00", "14:00"],
            "2022-04-15": ["11:00", "12:00", "14:00"],
            "2022-04-16": ["11:00", "12:00", "14:00"],
          },
        },
      },
      doctorsDirection: {
        Гастроэнтерология: [
          "Имаева Светлана Игоревна",
          "Петрова Аэлита Венеровна",
        ],
        Гинекология: [
          "Абдуллина Алия Маратовна",
          "Альмухаметов Аэлита Рамилевна",
        ],
        Дерматовенерология: [
          "Медведев Петр Николаевич",
          "Валеева Эльза Сергеевна",
        ],
        Диетология: [
          "Шарифуллин Эдуард Васильевич",
          "Чижкова Екатерина Викторовна",
        ],
        Кардиология: ["Хайретдинов Ямиль Мусаевич", "Сидоров Артем Петрович"],
        Стоматология: [
          "Азаматова Гузель Карамовна",
          "Булатов Ильнур Айнурович",
        ],
      },
      steps: {
        step2: false,
        step3: false,
        step4: false,
        step5: false,
        step6: false,
      },
    };
  },
  components: {
    TheHeader,
    SearchFirm,
    AllFirms,
    AboutFirm,
    ContactPerson,
    DirectionDoctor,
    ChooseDoctor,
    DateOfAppointment,
    ClientsForm,
    SendData,
    TheFooter,
  },
  methods: {
    selectedOption(index) {
      this.indexFirm = String(index);
      this.allObject["firmName"] = this.arrayFirms[this.indexFirm].value;
      this.changeSelect();
    },
    searchSelect(selectValue) {
      this.inputFirm = selectValue;
      this.updateFirms();
    },
    changeSelect() {
      this.openOptions = !this.openOptions;
    },
    clearSelect() {
      this.inputFirm = "";
      this.indexFirm = "";
      this.arrayFirms = [];
    },
    updateFirms() {
      fetch(
        "https://suggestions.dadata.ru/suggestions/api/4_1/rs/suggest/party",
        {
          method: "POST",
          mode: "cors",
          headers: {
            "Content-Type": "application/json",
            Accept: "application/json",
            Authorization:
              "Token " + "ed24ff9d9ff06010196152f6a5397f066a3f8fc7",
          },
          body: JSON.stringify({ query: this.inputFirm }),
        }
      )
        .then((response) => response.json())
        .then((json) => {
          this.arrayFirms = json.suggestions;
          console.log(this.arrayFirms);
        })
        .catch((error) => console.log("error", error));
    },
    doctorOption(option) {
      this.directionName = option;
      this.allObject["directionName"] = option;
    },
    chooseDoctor(nameDoctor) {
      this.nameDoctor = nameDoctor;
      this.allObject["doctorName"] = nameDoctor;
      this.steps.step5 = true;
    },
    saveForm(inputName, inputEmail, inputPhone, inputMess) {
      this.allObject["contactPerson"] = {
        name: inputName,
        email: inputEmail,
        phone: inputPhone,
        mess: inputMess,
      };
      this.steps.step3 = true;
    },
    saveClientForm(clientArray) {
      this.allObject["clients"] = clientArray;
      this.steps.step4 = true;
    },
    chooseDoctorTime(doctorDate, doctorTime) {
      this.allObject["doctorDate"] = [doctorDate, doctorTime];
      this.steps.step6 = true;
    },
    activateStep2() {
      this.steps.step2 = true;
    },
    saveAll() {
      console.log(this.allObject);
      localStorage["medical clinic"] = JSON.stringify(this.allObject);
    },
  },
};
</script>

<style>
body {
  margin: 0 auto;
  font-family: "Open Sans", sans-serif;
}
* {
  box-sizing: border-box;
}
.container {
  margin: 0 auto;
  max-width: 1440px;
}
.select {
  width: 500px;
  cursor: pointer;
}

.select.is-active .select__body {
  display: block;
}

.select__icon {
  width: 40px;
  height: 40px;
  display: flex;
  flex-shrink: 0;
  justify-content: center;
  align-items: center;
  text-align: center;
}

.info__img {
  background-image: url(./assets/img/col-md-6.png);
  width: 41%;
  background-size: 92%;
  background-repeat: no-repeat;
  background-position: right center;
}
.info-section {
  display: flex;
  height: 600px;
  justify-content: space-between;
}
.info__service {
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  padding: 30px 0px;
  width: 50%;
}
h1 {
  font-size: 55px;
  font-weight: 600;
}
.info__text {
  font-size: 25px;
  font-weight: 500;
}
.step {
  font-size: 22px;
  color: #e1670e;
  font-weight: 600;
  text-decoration: underline;
}
.firm-section {
  min-height: 316px;
}
h3 {
  font-size: 25px;
  margin-top: 0px;
}
section {
  margin-bottom: 10px;
}
</style>
